import React from "react";
import { BrowserRouter as Router, Route, Switch } from "react-router-dom";
import "./App.css";
import Importer from "./Importer";
import { DailyNutritionPlan, DishNutritions, TDEETable } from "./nutrition";
import { AccountExpedinture, MonthExpenditureChart } from "./accountant";
import Gmail from "./Gmail";

var db = {
  вівсянка: [0, 0, 65.7, 355].map(x => x / 100),
  спагетті: [0, 0, 75, 374].map(x => x / 100),
  "гречка (Бест Альтернатива)": [0, 0, 63, 335].map(x => x / 100),
  "рис (Wild&Brown Rice)": [0, 0, 74.2, 367].map(x => x / 100),

  "яйця (білок)": [4, 0, 0, 16],
  "яйця (жовток)": [4, 4.5, 0, 52],
  яйце: [8, 4.5, 0, 68],
  лосось: [20.5, 15.5, 0, 218].map(x => x / 100),
  "молоко пряжене": [3, 4.7, 1, 53].map(x => x / 100),
  'тунець шматочками "Премія"': [25.57, 0.56, 0, 140].map(x => x / 100),
  індичка: [19, 0, 0, 80].map(x => x / 100),
  "філе стегна": [19.5, 0, 4.5, 119].map(x => x / 100),
  'сир нежирний "President"': [15, 0.2, 1.8, 69].map(x => x / 100),
  'сир нежирний "Молокія"': [16, 0.2, 1.8, 69].map(x => x / 100),
  'сир нежирний "Organic Milk"': [18, 0.2, 1.8, 81].map(x => x / 100),

  фініки: [0, 0, 63.8, 285].map(x => x / 100),
  чорнослив: [2.2, 0.4, 64, 240].map(x => x / 100),
  "грейпфрутовий сік": [0, 0, 8, 39].map(x => x / 100),
  'йогурт грецький "extra 2%"': [6.7, 2, 4.9, 64].map(x => x / 100),
  'йогурт грецький премія "0%"': [8, 0, 5, 52].map(x => x / 100),
  "варення чорна смородина": [0, 0, 55, 220].map(x => x / 100),
  "шоколад (Noir 72%)": [7.86, 39.72, 35.47, 555].map(x => x / 10),
  "шоколад (Libeert Luxury 85%)": [10.1, 48.4, 16.2, 577].map(x => x / 10),
  "горіхи грецькі": [21.2, 56.6, 10.6, 636.6].map(x => x / 100),
  "маслини Iberica": [0, 16, 0, 151].map(x => x / 100),
  "малина заморожена": [0, 0, 10, 40].map(x => x / 100),
  "полуниця заморожена": [0, 0, 15, 60].map(x => x / 100),
  протеїн: [24, 1, 4, 120],
  "буряк варений": [1.4, 0.1, 8.7, 41].map(x => x / 100),
  окунь: [25, 1.2, 0, 117].map(x => x / 100),
  "моцарелла Galbani Light": [18, 11, 1.6, 173].map(x => x / 100),
  "ряжанка Яготинська": [3, 4, 3.5, 62].map(x => x / 100),
  банан: [1.3, 0, 27, 105],

  кешю: [18, 44, 30, 553].map(x => x / 100),
  мигдаль: [21, 49, 22, 576].map(x => x / 100),
  "мед акація": [0.8, 0, 74.8, 314].map(x => x / 100),
  олія: [0, 100, 0, 900].map(x => x / 100),
  цукор: [0, 0, 100, 400].map(x => x / 100),

  гранола: {
    вівсянка: 600,
    "мед акація": 400,
    // цукор: 50,
    кешю: 200,
    мигдаль: 200,
    олія: 15
  },

  "арахісова паста (Russing)": [25, 50, 14, 640].map(x => x / 100)
};

var mon = [
  ["моцарелла Galbani Light", 125],

  ["вівсянка", 110],
  ["фініки", 30],
  ["чорнослив", 30],
  ["молоко пряжене", 300],
  // ['грейпфрутовий сік', 250],

  ["гречка (Бест Альтернатива)", 80],
  ["індичка", 200],

  ["яйця (білок)", 6],
  ["яйця (жовток)", 3],
  ["буряк варений", 200],

  // ['шоколад (Noir 72%)', 2],
  ["горіхи грецькі", 30],
  ["чорнослив", 30],

  ['сир нежирний "Молокія"', 200]
];

var diet2 = [
  ["моцарелла Galbani Light", 125],

  ["вівсянка", 110],
  ["фініки", 30],
  ["чорнослив", 30],
  ["молоко пряжене", 300],
  // ['грейпфрутовий сік', 250],

  ["гречка (Бест Альтернатива)", 80],
  ["індичка", 200],

  ["яйця (білок)", 6],
  ["яйця (жовток)", 3],
  ["буряк варений", 200],

  // ['шоколад (Noir 72%)', 2],
  ["горіхи грецькі", 30],
  ["чорнослив", 30],

  ["окунь", 200]
];

var tue = [
  ["вівсянка", 80],
  ["фініки", 35],
  ["молоко пряжене", 250],
  ["грейпфрутовий сік", 250],
  ["малина заморожена", 150],
  ["полуниця заморожена", 150],
  ["протеїн", 2],

  ["яйця (білок)", 5],
  ["яйця (жовток)", 3],
  ["гречка (Бест Альтернатива)", 80],

  ["рис (Wild&Brown Rice)", 80],
  ["індичка", 250],
  ["маслини Iberica", 30],

  ["шоколад (Noir 72%)", 2],

  ['сир нежирний "President"', 250],
  ["горіхи грецькі", 20],
  ["варення чорна смородина", 20]
];

var wed = [
  ["вівсянка", 80],
  ["фініки", 35],
  ["молоко пряжене", 250],
  ["грейпфрутовий сік", 250],

  ["яйця (білок)", 5],
  ["яйця (жовток)", 3],
  ["рис (Wild&Brown Rice)", 80],

  ["лосось", 200],
  ["рис (Wild&Brown Rice)", 80],
  ["маслини Iberica", 30],

  ["шоколад (Noir 72%)", 2],

  ['йогурт грецький "extra 2%"', 150],
  ["горіхи грецькі", 20],
  ["варення чорна смородина", 20]
];

var thu = [
  ["вівсянка", 80],
  ["фініки", 35],
  ["молоко пряжене", 250],
  ["грейпфрутовий сік", 250],

  ["яйця (білок)", 5],
  ["яйця (жовток)", 3],
  ["гречка (Бест Альтернатива)", 80],

  ["індичка", 200],
  ["рис (Wild&Brown Rice)", 80],
  ["маслини Iberica", 30],

  ["шоколад (Noir 72%)", 2],

  ['йогурт грецький "extra 2%"', 300],
  ["горіхи грецькі", 20],
  ["варення чорна смородина", 20]
];

var fri = thu;
var sat = fri;
var sun = sat;

var cocktail = [
  ["грейпфрутовий сік", 250],
  ["малина заморожена", 150],
  ["полуниця заморожена", 150],
  ["протеїн", 2]
];

export default function App() {
  return (
    <Router>
      <div className="App">
        <Switch>
          <Route exact path="/">
            <>
              <Gmail clientId="322956686243-2kqhdrh08v4kaqfah8mia5b96640jmsj.apps.googleusercontent.com" />
              <DailyNutritionPlan
                foods={[
                  ["спагетті", 70],
                  ["яйце", 3],
                  ["лосось", 200],
                  ["філе стегна", 200]
                ]}
                db={db}
              />
              <DailyNutritionPlan
                foods={[
                  ["гранола", 100],
                  ["молоко пряжене", 250],
                  ["яйце", 3],
                  ["гречка (Бест Альтернатива)", 80],
                  ["індичка", 200],
                  ['сир нежирний "Organic Milk"', 300],
                  ["горіхи грецькі", 25],
                  ["арахісова паста (Russing)", 25]
                ]}
                db={db}
              />
              <DailyNutritionPlan key="mon" foods={mon} db={db} />
              <DailyNutritionPlan key="diet2" foods={diet2} db={db} />
              <TDEETable />
            </>
          </Route>

          <Route path="/accounts">
            <Importer>
              {transactions => (
                <AccountExpedinture
                  transactions={transactions}
                  key="AccountExpedinture"
                />
              )}
            </Importer>
          </Route>
        </Switch>
      </div>
    </Router>
  );
}
